article/a-simple-trainning-notes.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-10-02 Sat 19:32 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>简单培训笔记</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Jinghui Hu" />
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../readme.html"> UP </a>
 |
 <a accesskey="H" href="../index.html"> HOME </a>
</div><div id="content">
<h1 class="title">简单培训笔记</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org8d25b65">1. 数据库</a>
<ul>
<li><a href="#org911f333">1.1. MySQL 初始化</a></li>
<li><a href="#org943de0f">1.2. MySQL 连接</a></li>
<li><a href="#org484b181">1.3. 新建数据库和用户</a></li>
<li><a href="#orgc174bcc">1.4. 建库建表语句</a></li>
</ul>
</li>
<li><a href="#orgb3d4e62">2. Java 后端</a>
<ul>
<li><a href="#orgd650eca">2.1. 技术点</a></li>
<li><a href="#org974d6a1">2.2. Java 配置</a></li>
<li><a href="#orgf7fddd7">2.3. Maven</a></li>
<li><a href="#orgb6c67fd">2.4. 新建项目</a></li>
<li><a href="#org9b54341">2.5. 配置数据库 MySQL</a></li>
</ul>
</li>
<li><a href="#orgd52bb94">3. 参考链接</a></li>
</ul>
</div>
</div>


<div id="outline-container-org8d25b65" class="outline-2">
<h2 id="org8d25b65"><span class="section-number-2">1</span> 数据库</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org911f333" class="outline-3">
<h3 id="org911f333"><span class="section-number-3">1.1</span> MySQL 初始化</h3>
<div class="outline-text-3" id="text-1-1">
<div class="org-src-container">
<pre class="src src-sh">-- &#21021;&#22987;&#21270;&#25968;&#25454;&#24211;
mysqld.exe --initialize-insecure --basedir=C:\Local\mysql-5.7.26-winx64 --datadir=C:\Local\mysql-5.7.26-winx64\data

-- &#21021;&#22987;&#21270;&#25968;&#25454;&#24211;&#35777;&#20070;
mysql_ssl_rsa_setup --datadir=C:\Local\mysql-5.7.26-winx64\data
</pre>
</div>
</div>
</div>

<div id="outline-container-org943de0f" class="outline-3">
<h3 id="org943de0f"><span class="section-number-3">1.2</span> MySQL 连接</h3>
<div class="outline-text-3" id="text-1-2">
<div class="org-src-container">
<pre class="src src-sh">mysql -uroot -h 127.0.0.1
</pre>
</div>
</div>
</div>

<div id="outline-container-org484b181" class="outline-3">
<h3 id="org484b181"><span class="section-number-3">1.3</span> 新建数据库和用户</h3>
<div class="outline-text-3" id="text-1-3">
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #75715E; font-style: italic;">-- &#21019;&#24314;&#25968;&#25454;&#24211;</span>
<span style="color: #F92672;">create</span> database test01 <span style="color: #F92672;">default</span> <span style="color: #66D9EF;">character</span> <span style="color: #F92672;">set</span> = <span style="color: #E6DB74;">'utf8mb4'</span> <span style="color: #F92672;">collate</span> utf8mb4_general_ci;

<span style="color: #75715E; font-style: italic;">-- &#21019;&#24314;&#29992;&#25143;&#24182;&#25480;&#26435;</span>
<span style="color: #F92672;">create</span> <span style="color: #F92672;">user</span> <span style="color: #E6DB74;">'user01'</span>@<span style="color: #E6DB74;">'%'</span> identified <span style="color: #F92672;">by</span> <span style="color: #E6DB74;">'password'</span>;
<span style="color: #F92672;">grant</span> <span style="color: #F92672;">all</span> <span style="color: #F92672;">privileges</span> <span style="color: #F92672;">on</span> test01.* <span style="color: #F92672;">to</span> <span style="color: #E6DB74;">'user01'</span>@<span style="color: #E6DB74;">'%'</span>;
flush <span style="color: #F92672;">privileges</span>;
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc174bcc" class="outline-3">
<h3 id="orgc174bcc"><span class="section-number-3">1.4</span> 建库建表语句</h3>
<div class="outline-text-3" id="text-1-4">
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #75715E; font-style: italic;">-- &#21019;&#24314;&#34920;</span>
<span style="color: #F92672;">create</span> <span style="color: #F92672;">table</span> if <span style="color: #F92672;">not</span> <span style="color: #F92672;">exists</span> <span style="color: #A6E22E;">employee</span> (
  empl_id bigint <span style="color: #F92672;">not</span> <span style="color: #F92672;">null</span> <span style="color: #F92672;">primary</span> <span style="color: #F92672;">key</span> auto_increment,
  empl_code <span style="color: #66D9EF;">varchar</span>(128),
  empl_name <span style="color: #66D9EF;">varchar</span>(128)
  empl_gender <span style="color: #66D9EF;">varchar</span>(16),
  empl_note text
);
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgb3d4e62" class="outline-2">
<h2 id="orgb3d4e62"><span class="section-number-2">2</span> Java 后端</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orgd650eca" class="outline-3">
<h3 id="orgd650eca"><span class="section-number-3">2.1</span> 技术点</h3>
<div class="outline-text-3" id="text-2-1">
<ol class="org-ol">
<li>Spring Framework</li>
<li>Spring Boot</li>
<li>Maven</li>
</ol>
</div>
</div>

<div id="outline-container-org974d6a1" class="outline-3">
<h3 id="org974d6a1"><span class="section-number-3">2.2</span> Java 配置</h3>
<div class="outline-text-3" id="text-2-2">
<p>
配置以下环境变量
</p>
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #F92672;">export</span> <span style="color: #FD971F;">JAVA_HOME</span>=/usr/local/java/jdk1.8.0_191
<span style="color: #F92672;">export</span> <span style="color: #FD971F;">CLASSPATH</span>=.:$<span style="color: #FD971F;">JAVA_HOME</span>/lib/dt.jar:$<span style="color: #FD971F;">JAVA_HOME</span>/lib/tools.jar${<span style="color: #FD971F;">CLASSPATH</span>:+:${<span style="color: #FD971F;">CLASSPATH</span>}}
<span style="color: #F92672;">export</span> <span style="color: #FD971F;">MAVEN_HOME</span>=/usr/local/java/apache-maven-3.6.3
<span style="color: #F92672;">export</span> <span style="color: #FD971F;">PATH</span>=$<span style="color: #FD971F;">JAVA_HOME</span>/bin:$<span style="color: #FD971F;">MAVEN_HOME</span>/bin:$<span style="color: #FD971F;">PATH</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf7fddd7" class="outline-3">
<h3 id="orgf7fddd7"><span class="section-number-3">2.3</span> Maven</h3>
<div class="outline-text-3" id="text-2-3">
<p>
<a href="http://maven.apache.org/">Maven</a> 是 Java 项目中依赖包管理工具。官方给出了一个<a href="http://maven.apache.org/guides/getting-started/maven-in-five-minutes.html">五分钟教程</a>，里面有基本使用
的介绍
</p>

<p>
在国内访问官方 <a href="https://mvnrepository.com">Apache Maven Repository</a> 的镜像站比较慢， 一般会使用阿里的镜像
源来提高 Maven 下载包的速度。配置方法很简单，即在 <code>~/.m2/settings.xml</code> 文件中
添加如下配置
</p>
<div class="org-src-container">
<pre class="src src-xml">&lt;<span style="color: #A6E22E;">mirrors</span>&gt;
  &lt;<span style="color: #A6E22E;">mirror</span>&gt;
    &lt;<span style="color: #A6E22E;">id</span>&gt;aliyun&lt;/<span style="color: #A6E22E;">id</span>&gt;
    &lt;<span style="color: #A6E22E;">mirrorOf</span>&gt;*&lt;/<span style="color: #A6E22E;">mirrorOf</span>&gt;
    &lt;<span style="color: #A6E22E;">name</span>&gt;ALiYun Public Repository&lt;/<span style="color: #A6E22E;">name</span>&gt;
    &lt;<span style="color: #A6E22E;">url</span>&gt;https://maven.aliyun.com/nexus/content/groups/public&lt;/<span style="color: #A6E22E;">url</span>&gt;
  &lt;/<span style="color: #A6E22E;">mirror</span>&gt;
&lt;/<span style="color: #A6E22E;">mirrors</span>&gt;
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb6c67fd" class="outline-3">
<h3 id="orgb6c67fd"><span class="section-number-3">2.4</span> 新建项目</h3>
<div class="outline-text-3" id="text-2-4">
<p>
Spring Boot 提供了一个基于 web 的新建项目工具 <a href="http://start.spring.io/">start-spring-io</a> 。当然，也可以
通过命令行工具来创建。
</p>
</div>
</div>

<div id="outline-container-org9b54341" class="outline-3">
<h3 id="org9b54341"><span class="section-number-3">2.5</span> 配置数据库 MySQL</h3>
<div class="outline-text-3" id="text-2-5">
<p>
<code>application.yml</code> 配置文件中添加用户名、密码等相关信息
</p>
<div class="org-src-container">
<pre class="src src-yaml"><span style="color: #FD971F;">spring</span>:
  <span style="color: #FD971F;">jpa</span>:
    <span style="color: #FD971F;">database-platform</span>: org.hibernate.dialect.MySQL5Dialect
  <span style="color: #FD971F;">datasource</span>:
    <span style="color: #FD971F;">platform</span>: mysql
    <span style="color: #FD971F;">username</span>: username
    <span style="color: #FD971F;">password</span>: password
    <span style="color: #FD971F;">url</span>: jdbc:mysql://localhost:3306/database?useUnicode=true<span style="color: #A6E22E;">&amp;characterEncoding</span>=utf-8<span style="color: #A6E22E;">&amp;useSSL</span>=false
    <span style="color: #FD971F;">driver-class-name</span>: com.mysql.jdbc.Driver
</pre>
</div>

<p>
<code>pom.xml</code> 文件中添加 MySQL 依赖
</p>
<div class="org-src-container">
<pre class="src src-xml">&lt;<span style="color: #A6E22E;">dependency</span>&gt;
  &lt;<span style="color: #A6E22E;">groupId</span>&gt;mysql&lt;/<span style="color: #A6E22E;">groupId</span>&gt;
  &lt;<span style="color: #A6E22E;">artifactId</span>&gt;mysql-connector-java&lt;/<span style="color: #A6E22E;">artifactId</span>&gt;
  &lt;<span style="color: #A6E22E;">version</span>&gt;5.1.47&lt;/<span style="color: #A6E22E;">version</span>&gt;
&lt;/<span style="color: #A6E22E;">dependency</span>&gt;
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgd52bb94" class="outline-2">
<h2 id="orgd52bb94"><span class="section-number-2">3</span> 参考链接</h2>
<div class="outline-text-2" id="text-3">
<ol class="org-ol">
<li><a href="https://docs.spring.io/spring-boot/docs/current/reference/html/cli-using-the-cli.html">Using Spring Boot CLI</a></li>
<li><a href="https://spring.io/projects/spring-boot">Spring Boot Project Homepage</a></li>
<li><a href="https://spring.io/guides/gs/rest-service/">RESTful Service</a></li>
<li><a href="https://spring.io/guides/gs/consuming-rest-angularjs/">Consuming a RESTful Web Service with AngularJS</a></li>
<li><a href="https://github.com/spring-guides/tut-rest.git">Spring Tutorial Github Repo</a></li>
<li><a href="https://www.imooc.com/learn/1058">Spring Boot 2.0 深度实践之系列总览</a></li>
</ol>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Last Updated 2021-10-02 Sat 19:32. Created by Jinghui Hu at 2021-09-10 Fri 09:59.</p>
</div>
</body>
</html>
